DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
#include <Arduino.h>
#include <DNSServer.h>
#include <EEPROM.h>
#include <ESP8266mDNS.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <LittleFS.h>
#include <Updater.h>

#include "../../firmware_shared/app_runtime.h"
#include "../../firmware_shared/app_transport.h"
#include "renderer_esp8266.h"

#ifndef CODEXBAR_DISPLAY_BOARD_ID
#define CODEXBAR_DISPLAY_BOARD_ID "esp8266-unknown"
#endif

#ifndef CODEXBAR_DISPLAY_FW_VERSION
#define CODEXBAR_DISPLAY_FW_VERSION "dev"
#endif

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
const char kThemeFeatureJSON[] = "[\"theme\",\"theme-spec-v1\"]";
#else
const char kThemeFeatureJSON[] = "[\"theme\"]";
#endif

namespace {

codexbar_display::app::RuntimeContext runtimeCtx;
codexbar_display::esp8266::RendererESP8266 renderer;
ESP8266WebServer webServer(80);
DNSServer dnsServer;

constexpr int kMaxFrameBytes = 1024;
constexpr uint16_t kDnsPort = 53;
constexpr uint32_t kWifiCredsMagic = 0x56544231UL;  // VTB1
constexpr uint32_t kBootRecoveryMagic = 0x56544252UL;  // VTBR
constexpr size_t kWifiSsidBytes = 33;
constexpr size_t kWifiPasswordBytes = 65;
constexpr size_t kWifiCredsBytes = 4 + kWifiSsidBytes + kWifiPasswordBytes;
constexpr size_t kBootRecoveryOffset = kWifiCredsBytes;
constexpr size_t kBootRecoveryBytes = 5;
constexpr size_t kEepromBytes = kWifiCredsBytes + kBootRecoveryBytes;
constexpr unsigned long kWifiConnectTimeoutMs = 20000UL;
constexpr unsigned long kWifiReconnectRetryMs = 5000UL;
constexpr unsigned long kWifiReconnectFallbackMs = 120000UL;
constexpr unsigned long kRebootDelayMs = 750UL;
constexpr unsigned long kBootRecoveryStableMs = 30000UL;
constexpr unsigned long kFrameStaleWarningMs = 150000UL;
constexpr unsigned long kFirmwareUpdateNoticeToggleMs = 1500UL;
constexpr uint8_t kBootRecoveryThreshold = 3;
constexpr size_t kMaxAssetPathBytes = 96;
const char kSetupApSsid[] = "VibeTV-Setup";
const char kSetupHost[] = "vibetv.local";
const char kMdnsName[] = "vibetv";
const char kMdnsHost[] = "vibetv.local";
const char kFirmwareManifestUrl[] = "https://vibetv.shop/cdn/shop/t/1/assets/firmware-manifest.json";
const char* const kFirmwareUpdateNoticeTexts[] = {
    "Update",
    "available",
    "go to",
    "vibetv.local",
};
constexpr uint8_t kFirmwareUpdateNoticeTextCount =
    sizeof(kFirmwareUpdateNoticeTexts) / sizeof(kFirmwareUpdateNoticeTexts[0]);

struct WifiCredentials {
  char ssid[kWifiSsidBytes] = {0};
  char password[kWifiPasswordBytes] = {0};
};

struct FirmwareUpdateState {
  bool available = false;
  String latestVersion;
  String lastStatus = "disabled";
  String lastError;
  unsigned long lastCheckedAtMs = 0;
  unsigned long nextCheckAtMs = 0;
  bool noticeVisible = false;
  uint8_t noticePhase = 0;
  unsigned long noticeLastToggleAtMs = 0;
};

bool httpServerStarted = false;
bool setupMode = false;
bool waitStatusRendered = false;
bool otaUploadSucceeded = false;
bool otaUploadInProgress = false;
String otaUploadError;
bool assetUploadSucceeded = false;
String assetUploadError;
String assetUploadPath;
String setupWifiOptionsHTML;
bool rebootPending = false;
unsigned long rebootAtMs = 0;
bool bootRecoveryCounterNeedsClear = false;
unsigned long bootRecoveryClearAtMs = 0;
unsigned long lastFrameAcceptedAtMs = 0;
bool frameStaleStatusRendered = false;
bool captiveDnsStarted = false;
bool mdnsStarted = false;
unsigned long wifiDisconnectedAtMs = 0;
unsigned long wifiReconnectAttemptAtMs = 0;
bool wifiReconnectStatusRendered = false;
FirmwareUpdateState firmwareUpdate;
bool firmwareUpdateTopLineDirty = false;

String jsonEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length() + 8);
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '\\':
        escaped += "\\\\";
        break;
      case '"':
        escaped += "\\\"";
        break;
      case '\n':
        escaped += "\\n";
        break;
      case '\r':
        escaped += "\\r";
        break;
      case '\t':
        escaped += "\\t";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

void appendJSONNullableString(String& out, const String& value) {
  if (value.length() == 0) {
    out += "null";
    return;
  }
  out += "\"";
  out += jsonEscape(value);
  out += "\"";
}

void markFirmwareUpdateNoticeDirty() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  if (!runtimeCtx.screenDirty && !waitStatusRendered && !frameStaleStatusRendered) {
    firmwareUpdateTopLineDirty = true;
  } else {
    runtimeCtx.screenDirty = true;
  }
}

void applyFirmwareUpdateNoticePhase() {
  if (firmwareUpdate.noticePhase == 0 ||
      firmwareUpdate.noticePhase > kFirmwareUpdateNoticeTextCount) {
    runtimeCtx.topLineOverride = "";
    firmwareUpdate.noticeVisible = false;
    firmwareUpdate.noticePhase = 0;
    return;
  }
  runtimeCtx.topLineOverride = kFirmwareUpdateNoticeTexts[firmwareUpdate.noticePhase - 1];
  firmwareUpdate.noticeVisible = true;
}

void clearFirmwareUpdateNotice() {
  if (runtimeCtx.topLineOverride.length() == 0 && !firmwareUpdate.noticeVisible) {
    return;
  }
  runtimeCtx.topLineOverride = "";
  firmwareUpdate.noticeVisible = false;
  firmwareUpdate.noticePhase = 0;
  firmwareUpdate.noticeLastToggleAtMs = millis();
  markFirmwareUpdateNoticeDirty();
}

void maintainFirmwareUpdateNotice() {
  if (!firmwareUpdate.available ||
      setupMode ||
      frameStaleStatusRendered ||
      !codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    clearFirmwareUpdateNotice();
    return;
  }

  const unsigned long nowMs = millis();
  if (firmwareUpdate.noticeLastToggleAtMs == 0) {
    firmwareUpdate.noticeLastToggleAtMs = nowMs;
    return;
  }
  if ((nowMs - firmwareUpdate.noticeLastToggleAtMs) < kFirmwareUpdateNoticeToggleMs) {
    return;
  }

  firmwareUpdate.noticeLastToggleAtMs = nowMs;
  firmwareUpdate.noticePhase =
      (firmwareUpdate.noticePhase + 1) % (kFirmwareUpdateNoticeTextCount + 1);
  applyFirmwareUpdateNoticePhase();
  markFirmwareUpdateNoticeDirty();
}

void applyFrameUpdateState() {
  if (!codexbar_display::app::HasFrame(runtimeCtx)) {
    return;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (!frame.hasUpdateAvailable) {
    return;
  }

  String nextStatus = frame.updateStatus;
  if (nextStatus.length() == 0) {
    nextStatus = frame.updateAvailable ? "update_available" : "current";
  }
  const bool changed = firmwareUpdate.available != frame.updateAvailable ||
                       firmwareUpdate.latestVersion != frame.updateLatestVersion ||
                       firmwareUpdate.lastStatus != nextStatus ||
                       firmwareUpdate.lastError != frame.updateLastError;
  firmwareUpdate.available = frame.updateAvailable;
  firmwareUpdate.latestVersion = frame.updateLatestVersion;
  firmwareUpdate.lastError = frame.updateLastError;
  firmwareUpdate.lastCheckedAtMs = millis();
  firmwareUpdate.nextCheckAtMs = 0;
  firmwareUpdate.lastStatus = nextStatus;

  if (!firmwareUpdate.available) {
    clearFirmwareUpdateNotice();
    return;
  }
  if (changed) {
    firmwareUpdate.noticeVisible = true;
    firmwareUpdate.noticePhase = 1;
    firmwareUpdate.noticeLastToggleAtMs = millis();
    applyFirmwareUpdateNoticePhase();
    runtimeCtx.screenDirty = true;
  }
}

void drawWaitingForCompanionStatus() {
  renderer.DrawConnectedSetupInstructions(runtimeCtx, kMdnsHost, WiFi.localIP().toString());
  waitStatusRendered = true;
}

void drawWifiConnectingStatus(const String& ssid) {
  renderer.DrawStatus(runtimeCtx, "VIBE TV", "Connecting WiFi", ssid);
}

