DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleAssetUpload() {
  HTTPUpload& upload = webServer.upload();

  if (upload.status == UPLOAD_FILE_START) {
    assetUploadSucceeded = false;
    assetUploadError = "";
    assetUploadPath = requestedAssetPath();
    Serial.printf("asset_upload_start path=%s filename=%s content_length=%zu\n", assetUploadPath.c_str(), upload.filename.c_str(), upload.contentLength);
    drawUpdateStatus("Loading display");
    renderer.ResetGifStateForAssetUpdate();
    waitStatusRendered = true;

    if (!isSafeAssetPath(assetUploadPath)) {
      setAssetUploadError("invalid asset path");
      return;
    }
    if (!LittleFS.begin()) {
      setAssetUploadError("filesystem mount failed");
      return;
    }
    if (!ensureAssetParentDirs(assetUploadPath)) {
      setAssetUploadError("create parent directory failed");
      return;
    }
    if (LittleFS.exists(assetUploadPath)) {
      LittleFS.remove(assetUploadPath);
    }
    File file = LittleFS.open(assetUploadPath, "w");
    if (!file) {
      setAssetUploadError("open asset failed");
      return;
    }
    file.close();
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (assetUploadError.length() > 0) {
      return;
    }
    File file = LittleFS.open(assetUploadPath, "a");
    if (!file) {
      setAssetUploadError("append asset failed");
      return;
    }
    if (file.write(upload.buf, upload.currentSize) != upload.currentSize) {
      setAssetUploadError("write asset failed");
    }
    file.close();
  } else if (upload.status == UPLOAD_FILE_END) {
    if (assetUploadError.length() == 0) {
      assetUploadSucceeded = true;
      Serial.printf("asset_upload_success path=%s bytes=%zu\n", assetUploadPath.c_str(), upload.totalSize);
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    setAssetUploadError("upload aborted");
  }
  yield();
}

void handleAssetUploadResult() {
  if (!assetUploadSucceeded || assetUploadError.length() > 0) {
    const String error = assetUploadError.length() > 0 ? assetUploadError : "upload failed";
    webServer.send(400, "text/plain; charset=utf-8", error);
    return;
  }

  String out;
  out.reserve(120);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(assetUploadPath);
  out += "\"}";
  webServer.send(200, "application/json", out);
}

void handleAssetDelete() {
  String path = webServer.arg("path");
  path.trim();
  if (!isSafeAssetPath(path)) {
    webServer.send(400, "text/plain; charset=utf-8", "invalid asset path");
    return;
  }
  if (!LittleFS.begin()) {
    webServer.send(500, "text/plain; charset=utf-8", "filesystem mount failed");
    return;
  }
  if (!LittleFS.exists(path)) {
    webServer.send(404, "text/plain; charset=utf-8", "asset not found");
    return;
  }
  renderer.ResetGifStateForAssetUpdate();
  if (!LittleFS.remove(path)) {
    webServer.send(500, "text/plain; charset=utf-8", "asset delete failed");
    return;
  }
  Serial.printf("asset_deleted path=%s\n", path.c_str());
  webServer.send(200, "application/json", "{\"ok\":true}");
}

String updatePageHTML() {
  const String installCommand = updateInstallCommand();
  String html;
  html.reserve(3400);
  html += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  html += F("<title>VibeTV Update</title><style>");
  html += F("body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:0;background:#101113;color:#f7f7f2}");
  html += F("main{max-width:520px;margin:0 auto;padding:32px 20px}section{border-top:1px solid #333;padding:22px 0}");
  html += F("input,button{box-sizing:border-box;width:100%;font:inherit;padding:12px;border-radius:8px;border:1px solid #555;background:#181a1d;color:#fff}");
  html += F("button,a.button{box-sizing:border-box;display:block;width:100%;font:inherit;text-align:center;text-decoration:none;margin-top:12px;padding:12px;border-radius:8px;background:#c7ff00;color:#111;border:0;font-weight:700}");
  html += F(".muted{color:#aaa;line-height:1.4}.warn{color:#c7ff00;font-weight:700}.secondary{background:#24272c;color:#f7f7f2;border:1px solid #3a3f47}");
  html += F("code,pre{font-family:ui-monospace,SFMono-Regular,Menlo,Consolas,monospace}code{background:#181a1d;padding:2px 5px;border-radius:4px}pre{white-space:pre-wrap;word-break:break-word;background:#0c0d0f;border:1px solid #333;border-radius:8px;padding:14px;color:#fff}</style></head><body><main>");
  html += F("<h1>VibeTV Update</h1>");
  html += updateStatusHTML(false);
  html += F("<section><h2>Install with Mac</h2><p class='muted'>Run this on the connected Mac. Companion downloads firmware, checks SHA256, uploads it, and waits for restart.</p><pre>");
  html += htmlEscape(installCommand);
  html += F("</pre></section>");
  html += F("<section><h2>Manual firmware upload</h2><p class='muted'>Support fallback only. Upload matching <code>firmware.bin</code>.</p>");
  html += F("<form method='post' action='/update/firmware' enctype='multipart/form-data'>");
  html += F("<input type='file' name='firmware' accept='.bin,application/octet-stream' required>");
  html += F("<button type='submit'>Upload firmware</button></form></section>");
  html += F("<section><h2>Display files</h2><p class='muted'>Support fallback for display package or a single file.</p>");
  html += F("<form method='post' action='/update/filesystem' enctype='multipart/form-data'>");
  html += F("<input type='file' name='filesystem' accept='.bin,application/octet-stream' required>");
  html += F("<button type='submit'>Upload display files</button></form>");
  html += F("<form method='post' action='/assets' enctype='multipart/form-data'>");
  html += F("<input name='path' placeholder='/asset.gif' required>");
  html += F("<input type='file' name='asset' accept='.gif,.jpg,.jpeg,.png,.json,application/octet-stream' required>");
  html += F("<button type='submit'>Upload file</button></form></section>");
  html += F("<p class='muted'><a href='/'>Home</a> · <a href='/health'>Device status</a> · <a href='/assets'>File list</a></p></main></body></html>");
  return html;
}

